KCX-Mapping-Convert/testdaten/EMCS-V20/UidsFromKids/EMCSReportOfReceipt.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Header xmlns="http://www.eurtradenet.com/schemas/header/200310" soap:mustUnderstand="true"><To>DE01.CSFALT.2144</To><From>DE.CSF</From><MessageID>EI20100519</MessageID><SentAt>2011-08-18 12:02:00 +0200</SentAt><Act>request</Act><Method>EMCS</Method><MessageVersion>2.0</MessageVersion><MessageType>EMCSReportOfReceipt</MessageType></Header></soap:Header><soap:Body><Submit xmlns="http://www.eurtradenet.com/schemas/uids/emcs/body/200911"><EMCS><EMCSReportOfReceipt><LocalReferenceNumber>ReferenceNumber</LocalReferenceNumber><AadReferenceCode>AadReferenceCode</AadReferenceCode><SequenceNumber>6</SequenceNumber><DestinationOffice>DestinationOffice</DestinationOffice><DateAndTimeOfValidation>2010-05-20T13:55:00+0200</DateAndTimeOfValidation><DateOfArrivalOfExciseProducts>2010-05-25T00:00:00+0200</DateOfArrivalOfExciseProducts><GlobalConclusionOfReceipt>V20-GlobalConclusionOfReceipt</GlobalConclusionOfReceipt><ComplementaryInformation language="CI">ComplementaryInformation</ComplementaryInformation><ConsigneeTrader><CustomerID>CustomerID-Consignee</CustomerID><VATID>VATID-Consignee</VATID><Address><Name>Name-Consignee</Name><Street>StreetAndNumber-Consignee</Street><PostalCode>PostalCode-Consignee</PostalCode><City>City-Consignee</City><Language>CE</Language></Address></ConsigneeTrader><DeliveryPlaceTrader><CustomerID>CustomerID-DP</CustomerID><VATID>VATID-DP</VATID><Address><Name>Name</Name><Street>StreetAndNumber-DP</Street><PostalCode>PostalCode-DP</PostalCode><City>City-DP</City><Language>DP</Language></Address></DeliveryPlaceTrader><GoodsItem><ItemNumber>1</ItemNumber><ExciseProductCode>A000</ExciseProductCode><RefusedQuantity>RefusedQuantity</RefusedQuantity><IndicatorOfShortageOrExcess>IndicatorOfShortageOrExcess</IndicatorOfShortageOrExcess><ObservedShortageOrExcess>ObservedShortageOrExcess</ObservedShortageOrExcess><UnsatisfactoryReason><UnsatisfactoryReasonCode>UnsatisfactoryReasonCode</UnsatisfactoryReasonCode><ComplementaryInformation language="CI">ComplementaryInformation</ComplementaryInformation></UnsatisfactoryReason></GoodsItem><GoodsItem><ItemNumber>2</ItemNumber><ExciseProductCode>B000</ExciseProductCode><RefusedQuantity>RefusedQuantity</RefusedQuantity><IndicatorOfShortageOrExcess>IndicatorOfShortageOrExcess</IndicatorOfShortageOrExcess><ObservedShortageOrExcess>ObservedShortageOrExcess</ObservedShortageOrExcess><UnsatisfactoryReason><UnsatisfactoryReasonCode>UnsatisfactoryReasonCode</UnsatisfactoryReasonCode><ComplementaryInformation language="CI">ComplementaryInformation</ComplementaryInformation></UnsatisfactoryReason></GoodsItem></EMCSReportOfReceipt></EMCS></Submit></soap:Body></soap:Envelope>
